app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
   @books = Book.new
   @book = Book.find(params[:id])

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "ABCD"], ["body", "oo"], ["created_at", "2023-01-24 09:57:53.462926"], ["updated_at", "2023-01-24 09:57:53.462926"], ["user_id", 1]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
    redirect_to book_path(@book.id)
    else
      @books = Book.all