app/controllers/users_controller.rb

  def edit
    user_id = params[:id].to_i
   unless user_id == current_user.id
    redirect_to user_path(current_user)
   end
   @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
   @user = User.find(params[:id])
   if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ?, "introduction" = ? WHERE "users"."id" = ?  [["name", "9pozjhv1g"], ["updated_at", "2023-01-24 09:58:53.039708"], ["introduction", "q9kj6sw33v25zar6fn0"], ["id", 2]]